Repository: iebb/Telisten
Catalog: Telisten/Localizable.xcstrings
Source language: en
Languages: es, fr, ja, ko, vi, zh_hans, zh_hant

source: Use an OpenAI-compatible endpoint supporting JSON chat completions. Generating sends lyric text and your prompt to this provider and may incur its usage charges. The API key is stored in device-local Keychain for this endpoint. Automatic generation is off by default; use Generate Pronunciation in the lyrics menu.
es: Utilice un punto final compatible con OpenAI que admita la finalización de chat JSON. La generación envía el texto de la letra y su mensaje a este proveedor y puede incurrir en cargos de uso. La clave API se almacena en el llavero local del dispositivo para este punto final. La generación automática está desactivada de forma predeterminada; use Generar pronunciación en el menú de letras.
fr: Utilisez un point de terminaison compatible OpenAI prenant en charge les complétions de chat JSON. La génération envoie le texte des paroles et votre invite à ce fournisseur et peut entraîner des frais d'utilisation. La clé API est stockée dans le trousseau local de l’appareil pour ce point de terminaison. La génération automatique est désactivée par défaut ; utilisez Générer la prononciation dans le menu des paroles.
ja: JSON チャット補完をサポートする OpenAI 互換エンドポイントを使用します。生成すると歌詞テキストとプロンプトがこのプロバイダーに送信され、使用料が発生する場合があります。 API キーは、このエンドポイントのデバイスローカル キーチェーンに保存されます。自動生成はデフォルトではオフになっています。歌詞メニューの「発音の生成」を使用します。
ko: JSON 채팅 완료를 지원하는 OpenAI 호환 엔드포인트를 사용하세요. 생성하면 가사 텍스트와 메시지가 이 공급자에게 전송되며 사용 요금이 부과될 수 있습니다. API 키는 이 엔드포인트의 장치-로컬 키체인에 저장됩니다. 자동 생성은 기본적으로 꺼져 있습니다. 가사 메뉴에서 발음 생성을 사용하세요.
vi: Sử dụng điểm cuối tương thích với OpenAI hỗ trợ hoàn thành trò chuyện JSON. Việc tạo sẽ gửi văn bản lời bài hát và lời nhắc của bạn tới nhà cung cấp này và có thể phải chịu phí sử dụng. Khóa API được lưu trữ trong Chuỗi khóa cục bộ của thiết bị cho điểm cuối này. Việc tạo tự động bị tắt theo mặc định; sử dụng Tạo phát âm trong menu lời bài hát.
zh_hans: 使用支持 JSON 聊天完成的 OpenAI 兼容端点。生成会将歌词文本和您的提示发送给该提供商，并可能产生使用费。 API 密钥存储在该端点的设备本地钥匙串中。自动生成默认关闭；使用歌词菜单中的“生成发音”。
zh_hant: 使用支援 JSON 聊天完成的 OpenAI 相容端點。生成會將歌詞文字和您的提示發送給該提供者，並可能產生使用費。 API 金鑰儲存在該端點的裝置本機鑰匙串中。自動產生預設為關閉；使用歌詞選單中的「生成發音」。

source: Use another phone number
es: Usa otro número de teléfono
fr: Utiliser un autre numéro de téléphone
ja: 別の電話番号を使用する
ko: 다른 전화번호 사용
vi: Sử dụng số điện thoại khác
zh_hans: 使用另一个电话号码
zh_hant: 使用另一個電話號碼

source: Use phone number instead
es: Utilice el número de teléfono en su lugar
fr: Utilisez plutôt un numéro de téléphone
ja: 代わりに電話番号を使用してください
ko: 대신 전화번호를 사용하세요.
vi: Thay vào đó hãy sử dụng số điện thoại
zh_hans: 使用电话号码代替
zh_hant: 使用電話號碼代替

source: Use the base URL of an LRCLIB-compatible server. Telisten requests /api/get and /api/search; cached lyrics stay available offline.
es: Utilice la URL base de un servidor compatible con LRCLIB. Telisten solicita /api/get y /api/search; Las letras almacenadas en caché permanecen disponibles sin conexión.
fr: Utilisez l’URL de base d’un serveur compatible LRCLIB. Telisten interroge /api/get et /api/search ; les paroles mises en cache restent accessibles hors ligne.
ja: LRCLIB 互換サーバーのベース URL を使用します。 Telisten は /api/get および /api/search をリクエストします。キャッシュされた歌詞はオフラインでも利用できます。
ko: LRCLIB 호환 서버의 기본 URL을 사용하세요. Telisten은 /api/get 및 /api/search를 요청합니다. 캐시된 가사는 오프라인에서도 계속 사용할 수 있습니다.
vi: Dùng URL gốc của máy chủ tương thích với LRCLIB. Telisten gửi yêu cầu đến /api/get và /api/search; lời bài hát đã lưu vẫn dùng được khi ngoại tuyến.
zh_hans: 使用兼容 LRCLIB 的服务器根 URL。Telisten 会请求 /api/get 和 /api/search；已缓存的歌词可离线使用。
zh_hant: 使用相容 LRCLIB 的伺服器根 URL。Telisten 會請求 /api/get 和 /api/search；已快取的歌詞可離線使用。

source: Use the chat button to ask the bot for music, then return here to play it.
es: Utilice el botón de chat para pedirle música al bot y luego regrese aquí para reproducirla.
fr: Utilisez le bouton de discussion pour demander de la musique au bot, puis revenez ici pour la lire.
ja: チャット ボタンを使用してボットに音楽をリクエストし、ここに戻って音楽を再生します。
ko: 채팅 버튼을 사용하여 봇에게 음악을 요청한 다음 여기로 돌아와서 재생하세요.
vi: Sử dụng nút trò chuyện để yêu cầu bot phát nhạc, sau đó quay lại đây để phát.
zh_hans: 使用聊天按钮向机器人询问音乐，然后返回此处播放。
zh_hant: 使用聊天按鈕向機器人詢問音樂，然後回到此處播放。

source: Used
es: Usado
fr: Utilisé
ja: 中古品
ko: 중고
vi: đã qua sử dụng
zh_hans: 二手
zh_hant: 二手

source: Uses Apple’s on-device tokenizer and transliteration. No lyrics leave your device. Unusual names and context-dependent Japanese readings may be inaccurate; an LLM can help with these.
es: Utiliza el tokenizador y la transliteración del dispositivo de Apple. Ninguna letra sale de tu dispositivo. Los nombres inusuales y las lecturas japonesas que dependen del contexto pueden ser inexactas; un LLM puede ayudar con esto.
fr: Utilise le tokenizer et la translittération sur l'appareil d'Apple. Aucune parole ne quitte votre appareil. Les noms inhabituels et les lectures japonaises dépendant du contexte peuvent être inexactes ; un LLM peut vous aider.
ja: Apple のオンデバイストークナイザーと音訳を使用します。歌詞がデバイスから離れることはありません。珍しい名前や文脈に依存する日本語の読み方は不正確である可能性があります。 LLM はこれらに役立ちます。
ko: Apple의 기기 내 토크나이저 및 음역을 사용합니다. 기기에 가사가 남지 않습니다. 특이한 이름과 상황에 따른 일본어 읽기는 정확하지 않을 수 있습니다. LLM이 이에 도움을 줄 수 있습니다.
vi: Sử dụng mã thông báo và phiên âm trên thiết bị của Apple. Không có lời bài hát rời khỏi thiết bị của bạn. Những cái tên khác thường và cách đọc tiếng Nhật phụ thuộc vào ngữ cảnh có thể không chính xác; LLM có thể trợ giúp những việc này.
zh_hans: 使用 Apple 的设备上标记器和音译。没有歌词离开您的设备。不寻常的名称和依赖于上下文的日语读法可能不准确；法学硕士可以帮助解决这些问题。
zh_hant: 使用 Apple 的裝置上標記器和音譯。沒有歌詞離開您的裝置。不尋常的名稱和依賴上下文的日語讀法可能不準確；法學碩士可以幫助解決這些問題。

source: VERIFICATION CODE
es: CÓDIGO DE VERIFICACIÓN
fr: CODE DE VÉRIFICATION
ja: 検証コード
ko: 인증 코드
vi: MÃ XÁC MINH
zh_hans: 验证码
zh_hant: 驗證碼

source: Verification code sent to %@
es: Código de verificación enviado a %@
fr: Code de vérification envoyé à %@
ja: 確認コードが %@ に送信されました
ko: %@(으)로 인증 코드가 전송되었습니다.
vi: Mã xác minh được gửi tới %@
zh_hans: 验证码已发送至%@
zh_hant: 驗證碼已發送至%@

source: Verify %@
es: Verificar %@
fr: Vérifiez %@
ja: %@ を確認してください
ko: %@ 확인
vi: Xác minh %@
zh_hans: 验证%@
zh_hant: 驗證%@

source: Verify your email
es: Verifica tu correo electrónico
fr: Vérifiez votre email
ja: メールアドレスを確認してください
ko: 이메일을 확인하세요
vi: Xác minh email của bạn
zh_hans: 验证您的电子邮件
zh_hant: 驗證您的電子郵件

source: Waiting for %@…
es: Esperando a %@…
fr: En attente de %@…
ja: %@ を待っています…
ko: %@을(를) 기다리는 중…
vi: Đang chờ %@…
zh_hans: 等待%@...
zh_hant: 等待%@...

source: Width
es: Ancho
fr: Largeur
ja: 幅
ko: 폭
vi: Chiều rộng
zh_hans: 宽度
zh_hant: 寬度

source: YOUR PLAYLISTS
es: TUS LISTAS DE REPRODUCCIÓN
fr: VOS LISTES DE LECTURE
ja: あなたのプレイリスト
ko: 귀하의 재생 목록
vi: DANH SÁCH PHÁT CỦA BẠN
zh_hans: 您的播放列表
zh_hant: 您的播放清單

source: Your Telegram admin role does not allow this action.
es: Tu rol de administrador de Telegram no permite esta acción.
fr: Votre rôle d'administrateur Telegram ne permet pas cette action.
ja: Telegram 管理者の役割では、このアクションは許可されていません。
ko: 귀하의 Telegram 관리자 역할은 이 작업을 허용하지 않습니다.
vi: Vai trò quản trị viên Telegram của bạn không cho phép hành động này.
zh_hans: 您的 Telegram 管理员角色不允许此操作。
zh_hant: 您的 Telegram 管理員角色不允許此操作。

source: Your Telegram session expired. Sign in again to continue.
es: Tu sesión de Telegram expiró. Inicia sesión nuevamente para continuar.
fr: Votre session Telegram a expiré. Connectez-vous à nouveau pour continuer.
ja: Telegram セッションの有効期限が切れました。続行するには、再度サインインしてください。
ko: 텔레그램 세션이 만료되었습니다. 계속하려면 다시 로그인하세요.
vi: Phiên Telegram của bạn đã hết hạn. Đăng nhập lại để tiếp tục.
zh_hans: 您的 Telegram 会话已过期。重新登录以继续。
zh_hant: 您的 Telegram 會話已過期。重新登入以繼續。

source: Your music, everywhere.
es: Tu música, en todas partes.
fr: Ta musique, partout.
ja: あなたの音楽、 どこでも。
ko: 당신의 음악, 모든 곳에.
vi: Âm nhạc của bạn, ở khắp mọi nơi.
zh_hans: 你的音乐， 无处不在。
zh_hant: 你的音樂， 無處不在。

source: name@example.com
es: nombre@ejemplo.com
fr: nom@exemple.com
ja: 名前@example.com
ko: 이름@example.com
vi: tên@example.com
zh_hans: 姓名@example.com
zh_hant: 姓名@example.com

source: LLM
ko: 법학대학원
zh_hans: 法学硕士
zh_hant: 法學碩士
